{"keras_version": "1.1.1", "config": [{"config": {"output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-f279e207ae54>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "trainable": true, "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_row": 1, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 3, "W_regularizer": null, "subsample": [1, 1], "name": "conv0", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 1, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 24, "W_regularizer": null, "subsample": [1, 1], "name": "conv1", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 36, "W_regularizer": null, "subsample": [1, 1], "name": "conv2", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 48, "W_regularizer": null, "subsample": [1, 1], "name": "conv3", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "name": "conv4", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "bias": true, "dim_ordering": "tf", "W_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": null, "subsample": [1, 1], "name": "conv5", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "input_dim": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "input_dim": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_3", "input_dim": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_constraint": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_4", "input_dim": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}